app/Http/Controllers/ConveniosController.php

select * from `convenios`
---
    public function listar(Request $request){
        if(Auth::user()->cargo=='Administrador') //se valida el tipo de usuario
            $convenios = Convenios::all();
        else{
            $convenios = Convenios::all()->where('estado',1);
        }
        $convenios = Convenios::all();

select * from `convenios`
---
    public function exportar(Request $request){
        $input = $request->all();
        $convenios = Convenios::all();