app/Http/Controllers/EmpleadosController.php

    public function index(){
        if(Auth::user()->cargo=='Administrador') //se valida el tipo de usuario
            $empleados = Empleados::all();
---
select * from `empleados`

    public function exportar(Request $request){
        $input = $request->all();
        $empleados = Empleados::all();
---
select * from `empleados`