app/Http/Controllers/GastosController.php

select * from `gastos`
---
    public function listar(Request $request){
        $gastos = Gastos::all();

select * from `gastos`
---
    public function exportar(Request $request){
        $input = $request->all();
        $gastos = Gastos::all();