app/Http/Controllers/InsumosController.php

select * from `insumos`
select COUNT(*) as count from `insumos` group by nomCate
---
    public function index(){
        $insumos = Insumos::all();
        $userData = Insumos::select(\DB::raw("COUNT(*) as count"))
                    ->groupBy(\DB::raw("nomCate"))
                    ->pluck('count');

select * from `insumos`
---
    public function listar(){
        $insumos = Insumos::all();

select * from `insumos`
---
    public function exportar(Request $request){
        $input = $request->all();
        $insumos = Insumos::all();