app/Http/Controllers/PacientesController.php

    public function index(){
        if(Auth::user()->cargo == "Administrador"){
            $pacientes = Pacientes::all();
---
select * from `pacientes`

    public function create() {
        $sedes = Sedes::all();
        $convenios = Convenios::all();
        $tiposId = TiposId::all();
---
select * from `sedes`
select * from `convenios`
select * from `tipos_id`

    public function exportar(Request $request){
        $input = $request->all();
        $pacientes = Pacientes::all();
---
select * from `pacientes`