app/Http/Controllers/ProcedimientosController.php

select * from `procedimientos`
---
    public function listar(){
        if(Auth::user()->cargo=='Administrador') //se valida el tipo de usuario
            $procedimientos = Procedimientos::all();

select * from `procedimientos`
---
    public function exportar(Request $request){
        $input = $request->all();
        $procedimientos = Procedimientos::all();