app/Http/Controllers/RecaudosController.php

select * from `recaudos`
---
    public function listar(Request $request){
        $recaudos = Recaudos::all();

select * from `recaudos`
---
    public function exportar(Request $request){
        $input = $request->all();
        $recaudos = Recaudos::all();