app/Http/Controllers/SedesController.php

select * from `sedes`
---
    public function listar(Request $request){
        if(Auth::user()->cargo=='Administrador') //se valida el tipo de usuario
            $sedes = Sedes::all();